In [1]:
from mixmaster import mixmaster as mix

In [2]:
df = mix.raster2df('chirps-v2.0.2021.01.3.tif', feature_name='rainfall', band=1)

In [3]:
df.head()

   longitude  latitude  rainfall
0    -79.525    23.475  2.136781
1    -79.475    23.475  1.977196
2    -76.125    23.475  1.031077
3    -76.075    23.475  1.336039
4    -76.025    23.475  1.422843

In [4]:
df2 = mix.netcdf2df('tos_O1_2001-2002.nc')

In [5]:
df2.head()

,bnds,lat,lon,time,lon_bnds,lat_bnds,time_bnds,tos
0,0,-79.5,1.0,2001-01-16 00:00:00,-0.0,-80.0,2001-01-01 00:00:00,NaN
1,0,-79.5,1.0,2001-02-16 00:00:00,-0.0,-80.0,2001-02-01 00:00:00,NaN
2,0,-79.5,1.0,2001-03-16 00:00:00,-0.0,-80.0,2001-03-01 00:00:00,NaN
3,0,-79.5,1.0,2001-04-16 00:00:00,-0.0,-80.0,2001-04-01 00:00:00,NaN
4,0,-79.5,1.0,2001-05-16 00:00:00,-0.0,-80.0,2001-05-01 00:00:00,NaN